Ruby Store/app/controllers/items_controller.rb

  def show
	@item = Item.find(params[:id])
---
SELECT  "items".* FROM "items"  WHERE "items"."id" = ? LIMIT 1  [["id", 1]]

  def edit
	@item = Item.find(params[:id])
---
SELECT  "items".* FROM "items"  WHERE "items"."id" = ? LIMIT 1  [["id", 1]]

  def create

    @item = Item.new(item_params)

    #respond_to do |format|
      if @item.save
---
INSERT INTO "items" ("brand", "created_at", "name", "price", "stock", "type", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["brand", "Asus"], ["created_at", "2014-09-02 19:02:41.421748"], ["name", "Asus Ax-50"], ["price", 3.0], ["stock", 1], ["type", ""], ["updated_at", "2014-09-02 19:02:41.421748"]]

  def update
    respond_to do |format|
      if @item.update(item_params)
---
UPDATE "items" SET "brand" = ?, "name" = ?, "price" = ?, "type" = ?, "updated_at" = ? WHERE "items"."id" = 2  [["brand", "Asus"], ["name", "Asus Ax-50"], ["price", 200.0], ["type", "Laptop"], ["updated_at", "2014-09-02 19:10:22.606126"]]

  def destroy
    @item.destroy
---
DELETE FROM "items" WHERE "items"."id" = ?  [["id", 1]]