Ruby Store/app/controllers/users_controller.rb

INSERT INTO "users" ("address", "created_at", "email", "name", "pw", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["address", "c"], ["created_at", "2014-09-02 17:41:53.973490"], ["email", "c"], ["name", "c"], ["pw", "c"], ["updated_at", "2014-09-02 17:41:53.973490"]]
---
  def create

    @user = User.new(user_params)

    #respond_to do |format|
      if @user.save

UPDATE "users" SET "address" = ?, "email" = ?, "name" = ?, "pw" = ?, "updated_at" = ? WHERE "users"."id" = 1  [["address", "jonny Street 4h dir"], ["email", "johnny@hotmail.com"], ["name", "john"], ["pw", "123456"], ["updated_at", "2014-09-02 18:12:22.460073"]]
---
  def update
    respond_to do |format|
      if @user.update(user_params)