Ruby Store/app/controllers/welcome_controller.rb

SELECT "items".* FROM "items"
---
	def costumer
		@items = Item.all